
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>章前序 前端简介 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../../styles/website.css">
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../node1/" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../">
            
                <a href="../">
            
                    
                    第一章 前端开发
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="./">
            
                <a href="./">
            
                    
                    章前序 前端简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../node1/">
            
                <a href="../node1/">
            
                    
                    第一节 HTML基础课程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../node2/">
            
                <a href="../node2/">
            
                    
                    第二节 CSS基础课程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../node3/">
            
                <a href="../node3/">
            
                    
                    第三节 JavaScript入门与实战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../node4/">
            
                <a href="../node4/">
            
                    
                    第四节 JavaScript高级实战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../node5/">
            
                <a href="../node5/">
            
                    
                    第五节 jQuery入门与实战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="../node6/">
            
                <a href="../node6/">
            
                    
                    第六节 常用库和前端框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="../node7/">
            
                <a href="../node7/">
            
                    
                    第七节 HTML5新功能和高级机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="../node8/">
            
                <a href="../node8/">
            
                    
                    第八节 CSS3新特性详解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="../node9/">
            
                <a href="../node9/">
            
                    
                    第九节 实战案例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../chapter2/README.md">
            
                <span>
            
                    
                    第二章 后端开发
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../chapter2/README.md">
            
                <span>
            
                    
                    第二章 运维测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../../chapter2/README.md">
            
                <span>
            
                    
                    第二章 后端开发
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../../end/">
            
                <a href="../../end/">
            
                    
                    结束
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >章前序 前端简介</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x7AEF;&#x7B80;&#x4ECB;">&#x524D;&#x7AEF;&#x7B80;&#x4ECB;</h1>
<h2 id="1-&#x6982;&#x8FF0;">1. &#x6982;&#x8FF0;</h2>
<p>&#x524D;&#x7AEF;&#x662F;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x524D;&#x7AEF;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x524D;&#x7AEF;&#xFF0C;&#x5373;&#x7528;&#x6237;&#x80FD;&#x591F;&#x770B;&#x5230;&#xFF0C;&#x76F4;&#x63A5;&#x63A5;&#x89E6;&#x5230;&#x7684;&#x5C42;&#x9762;&#x90FD;&#x7B97;&#x662F;&#x524D;&#x7AEF;&#x3002;</p>
<p><img src="images/all.png" alt=""></p>
<h3 id="11-&#x524D;&#x7AEF;&#x5212;&#x5206;">1.1 &#x524D;&#x7AEF;&#x5212;&#x5206;</h3>
<ul>
<li><strong>WEB &#x524D;&#x7AEF;</strong></li>
</ul>
<p>&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668; (&#x624B;&#x673A;&#x3001;&#x7535;&#x8111;) &#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7AD9;&#x754C;&#x9762;&#xFF0C;&#x5C5E;&#x4E8E; WEB &#x524D;&#x7AEF;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x6253;&#x5F00;&#x767E;&#x5EA6;&#xFF0C;&#x6240;&#x5C55;&#x793A;&#x7684;&#x9875;&#x9762;&#x5C31;&#x662F;WEB&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x3002;&#x672C;&#x7AE0;&#x8282;&#x6240;&#x4ECB;&#x7ECD;&#x7684;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x4E5F;&#x6307;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x7684; WEB &#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x3002;</p>
<p><img src="images/baidu.png" alt=""> </p>
<ul>
<li><strong>&#x79FB;&#x52A8;&#x524D;&#x7AEF;</strong></li>
</ul>
<p>&#x79FB;&#x52A8;&#x524D;&#x7AEF;&#x4E3B;&#x8981;&#x6307;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5404;&#x5927;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4E0A;&#x4F7F;&#x7528;&#x7684;&#x539F;&#x751F;App&#x7684;&#x754C;&#x9762;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x624B;&#x673A;&#x5FAE;&#x4FE1;&#x7684;&#x804A;&#x5929;&#x754C;&#x9762;&#x548C;&#x670B;&#x53CB;&#x5708;&#x754C;&#x9762;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x79FB;&#x52A8;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x3002;</p>
<p><img src="images/mobile.png" alt=""></p>
<ul>
<li><strong>&#x7535;&#x8111;&#x5BA2;&#x6237;&#x7AEF;</strong></li>
</ul>
<p>&#x7535;&#x8111;&#x4E0A;&#x5B89;&#x88C5;&#x7684;&#x4E00;&#x4E9B;&#x684C;&#x9762;&#x8F6F;&#x4EF6;&#x754C;&#x9762;&#xFF0C;&#x5C5E;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x524D;&#x7AEF;&#x754C;&#x9762;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x540E;&#x5F00;&#x53D1;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684; Github &#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x3002;</p>
<p><img src="images/github.png" alt="Github"></p>
<h3 id="12-&#x8DE8;&#x5E73;&#x53F0;">1.2 &#x8DE8;&#x5E73;&#x53F0;</h3>
<p><img src="images/huafen.png" alt=""></p>
<p>&#x79FB;&#x52A8;&#x9886;&#x57DF;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x76EE;&#x524D;&#x9762;&#x4E34;&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9700;&#x4E0D;&#x540C;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#xFF0C;&#x540C;&#x4E00;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5B58;&#x5728;&#x4E0D;&#x540C;&#x7248;&#x672C;&#xFF0C;&#x540C;&#x4E00;&#x7248;&#x672C;&#x5B58;&#x5728;&#x4E0D;&#x540C;&#x673A;&#x578B;&#x7B49;&#x96BE;&#x9898;&#xFF0C;&#x7ED9;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x589E;&#x52A0;&#x4E86;&#x5F88;&#x5927;&#x96BE;&#x5EA6;&#x3002;&#x5728;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#xFF0C;&#x8DE8;&#x5E73;&#x53F0;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x6210;&#x4E3A;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x548C;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x9996;&#x9009;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x89E3;&#x51B3;&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x540C;&#x673A;&#x578B;&#x7EC8;&#x7AEF;&#x7684;&#x5F00;&#x53D1;&#x96BE;&#x9898;&#xFF0C;&#x4E3A;&#x4F01;&#x4E1A;&#x8282;&#x7701;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x548C;&#x4EBA;&#x5458;&#x6210;&#x672C;&#x3002;</p>
<p>&#x968F;&#x7740; HTML5 &#x7684;&#x5D1B;&#x8D77;&#x3001; JavaScript &#x4E00;&#x7EDF;&#x5929;&#x4E0B;&#x4E4B;&#x9645;&#xFF0C;&#x8DE8;&#x5E73;&#x53F0;&#x6280;&#x672F;&#x8D8A;&#x6765;&#x8D8A;&#x706B;&#xFF0C;&#x8FD9;&#x4E5F;&#x4F7F;&#x5F97;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x8D8A;&#x6765;&#x8D8A;&#x53D7;&#x5230;&#x91CD;&#x89C6;&#x3002;</p>
<ul>
<li><strong>Hybrid App</strong></li>
</ul>
<p>Hybrid App &#x4E3A;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#xFF0C;&#x662F;&#x6307;&#x4ECB;&#x4E8E; web-app&#x3001;native-app &#x8FD9;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;app&#xFF0C;&#x517C;&#x5177;&#x201C;Native App&#x826F;&#x597D;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x4F53;&#x9A8C;&#x7684;&#x4F18;&#x52BF;&#x201D;&#x548C;&#x201C;Web App&#x8DE8;&#x5E73;&#x53F0;&#x5F00;&#x53D1;&#x7684;&#x4F18;&#x52BF;&#x201D;&#x3002;</p>
<p><img src="images/12.png" alt=""></p>
<ul>
<li><strong>NW.js*</strong></li>
</ul>
<p>nw.js &#x53C8;&#x53EB; node-webkit &#xFF0C;&#x662F;&#x57FA;&#x4E8E; node.js &#x548C; chromium &#x7684;&#x684C;&#x9762;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="2-web-&#x524D;&#x7AEF;&#x5F00;&#x53D1;">2. WEB &#x524D;&#x7AEF;&#x5F00;&#x53D1;</h2>
<p>Web &#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5B66;&#x4E60;&#x7684;&#x5185;&#x5BB9;&#x8F83;&#x5BB9;&#x6613;&#xFF0C;&#x4E14;&#x9700;&#x6C42;&#x66F4;&#x5E7F;&#xFF0C;&#x9002;&#x7528;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x65E0;&#x9700;&#x914D;&#x7F6E;&#x590D;&#x6742;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5373;&#x53EF;&#x5F00;&#x53D1;&#xFF0C;&#x6240;&#x89C1;&#x5373;&#x6240;&#x5F97;&#x7684;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x5F88;&#x9002;&#x5408;&#x6211;&#x4EEC;&#x5165;&#x95E8;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x77E5;&#x5176;&#x7136;&#xFF0C;&#x77E5;&#x5176;&#x6240;&#x4EE5;&#x7136;&#xFF01;&#x5B66;&#x4E60; WEB &#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x63A2;&#x8BA8;&#x4E09;&#x4E2A;&#x54F2;&#x5B66;&#x95EE;&#x9898;&#xFF01;</p>
<p><img src="images/2.jpg" alt=""></p>
<h3 id="21-&#x6211;&#x662F;&#x8C01;&#xFF1F;">2.1 &#x6211;&#x662F;&#x8C01;&#xFF1F;</h3>
<p>Web &#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x9879;&#x5F88;&#x7279;&#x6B8A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6DB5;&#x76D6;&#x7684;&#x77E5;&#x8BC6;&#x9762;&#x975E;&#x5E38;&#x5E7F;&#xFF0C;&#x65E2;&#x6709;&#x5177;&#x4F53;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x53C8;&#x6709;&#x62BD;&#x8C61;&#x7684;&#x7406;&#x5FF5;&#x3002;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x5B83;&#x7684;&#x4E3B;&#x8981;&#x804C;&#x80FD;&#x5C31;&#x662F;&#x628A;&#x7F51;&#x7AD9;&#x7684;&#x754C;&#x9762;&#x66F4;&#x597D;&#x5730;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x3002;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x9700;&#x8981;&#x4E13;&#x4E1A;&#x7684;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x624D;&#x80FD;&#x505A;&#x597D;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4E13;&#x4E1A;&#x4EBA;&#x624D;&#x8FD1;&#x51E0;&#x5E74;&#x6765;&#x5907;&#x53D7;&#x9752;&#x7750;&#x3002;</p>
<p><img src="images/3.jpg" alt=""></p>
<h3 id="22-&#x6211;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#xFF1F;">2.2 &#x6211;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#xFF1F;</h3>
<ul>
<li><strong>Web 1.0&#x65F6;&#x4EE3;&#x2014;&#x2014;&#x2014;&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x4E16;&#x7EAA;</strong></li>
</ul>
<p>&#x63D0;&#x5230; Web 1.0&#xFF0C;&#x611F;&#x89C9;&#x8981;&#x56DE;&#x6EAF;&#x81F3;&#x300C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4E2D;&#x4E16;&#x7EAA;&#x300D;&#x3002;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;Internet &#x53EA;&#x662F;&#x4E00;&#x7EC4;&#x9759;&#x6001;&#x7F51;&#x7AD9;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#x5374;&#x6CA1;&#x6709;&#x4E92;&#x52A8;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x7F51;&#x7AD9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528; Photoshop &#x548C; Dreamweaver &#x7B49;&#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x3002;</p>
<p><strong>Web 1.0 &#x65F6;&#x4EE3;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x662F;&#x4E00;&#x5BB6;&#x5927;&#x578B;&#x5B9E;&#x4F53;&#x5546;&#x573A;&#xFF0C;&#x623F;&#x5B50;&#x56FA;&#x5B9A;&#x5728;&#x90A3;&#x91CC;(&#x4EBA;&#x4EEC;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x7535;&#x8111;&#x5728;&#x56FA;&#x5B9A;&#x7684;&#x5730;&#x65B9;&#x63A5;&#x5165;&#x4E92;&#x8054;&#x7F51;)&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x80FD;&#x8D2D;&#x4E70;&#x5546;&#x573A;&#x5C55;&#x793A;&#x7684;&#x5546;&#x54C1;&#x3002;</strong></p>
<p><img src="images/web1.jpg" alt=""></p>
<ul>
<li><strong>Web 2.0 &#x65F6;&#x4EE3;&#x2014;&#x2014;&#x2014;&#x2014;&#x771F;&#x6B63;&#x7684;&#x7F51;&#x6C11;&#x53C2;&#x4E0E;</strong></li>
</ul>
<p>&#x5230;&#x4E86; 2.0 &#x65F6;&#x4EE3;&#xFF0C;&#x7528;&#x8C03;&#x5236;&#x89E3;&#x8C03;&#x5668;&#x62E8;&#x53F7;&#x4E0A;&#x7F51;&#x7684;&#x77ED;&#x6682;&#x65F6;&#x5149;&#x8FC5;&#x901F;&#x6D88;&#x5931;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x53D8;&#x5F97;&#x66F4;&#x5FEB;&#x4E86;&#xFF0C;&#x66F4;&#x5FEB;&#x7684;&#x7F51;&#x901F;&#x4E3A;&#x4E92;&#x52A8;&#x5185;&#x5BB9;&#x94FA;&#x5E73;&#x4E86;&#x9053;&#x8DEF;&#xFF0C;&#x7F51;&#x7EDC;&#x4E16;&#x754C;&#x91CC;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4E0D;&#x518D;&#x4EC5;&#x4EC5;&#x662F;&#x56F4;&#x89C2;&#xFF0C;&#x800C;&#x662F;&#x53C2;&#x4E0E;&#x3002;</p>
<p>&#x968F;&#x7740;&#x4E92;&#x8054;&#x7F51;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x548C; HTML5&#x3001;CSS3 &#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5404;&#x79CD; Web &#x5E94;&#x7528;&#x5927;&#x91CF;&#x6D8C;&#x73B0;&#xFF0C;&#x7F51;&#x7AD9;&#x7684;&#x524D;&#x7AEF;&#x7531;&#x6B64;&#x53D1;&#x751F;&#x4E86;&#x7FFB;&#x5929;&#x8986;&#x5730;&#x7684;&#x53D8;&#x5316;&#x3002;&#x5404;&#x7C7B;&#x7F51;&#x7AD9;&#x66F4;&#x52A0;&#x6CE8;&#x91CD;&#x4E8E;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x548C;&#x4EA4;&#x4E92;&#x3002;&#x6240;&#x4EE5; Web 2.0 &#x65F6;&#x671F;&#x4E0D;&#x518D;&#x53EB;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#xFF0C;&#x800C;&#x662F;&#x53EB; Web &#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x3002;</p>
<p><strong>Web 2.0 &#x65F6;&#x4EE3;&#xFF0C;&#x5927;&#x578B;&#x5546;&#x573A;&#x53D8;&#x6210;&#x53EF;&#x79FB;&#x52A8;&#x7684;&#x4E86; (&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x7684;&#x51FA;&#x73B0;&#x4EBA;&#x4EEC;&#x968F;&#x65F6;&#x968F;&#x5730;&#x90FD;&#x53EF;&#x4EE5;&#x63A5;&#x5165;&#x4E92;&#x8054;&#x7F51;)&#xFF0C;&#x800C;&#x4E14;&#x5546;&#x573A;&#x5356;&#x7684;&#x4E1C;&#x897F;&#x66F4;&#x52A0;&#x591A;&#x6837;&#x5316;&#xFF0C;&#x987E;&#x5BA2;&#x7684;&#x8863;&#x98DF;&#x4F4F;&#x884C;&#x65B9;&#x9762;&#x7684;&#x6240;&#x9700;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x5546;&#x573A;&#x4E70;&#x5230;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5546;&#x573A;&#x7ED9;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x5546;&#x573A;&#x91CC;&#x9762;&#x5F00;&#x5C0F;&#x5E97;&#x94FA;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x751F;&#x4EA7;&#x7684;&#x5C0F;&#x5546;&#x54C1;&#x653E;&#x5230;&#x5E97;&#x94FA;&#x5C55;&#x793A;&#x3002;&#x7528;&#x6237;&#x5728;&#x901B;&#x5546;&#x573A;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x6311;&#x9009;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5546;&#x54C1;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#x5546;&#x54C1;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x5546;&#x573A;&#x53D1;&#x5E03;&#x6D88;&#x606F;&#xFF0C;&#x8BF7;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x5E2E;&#x5FD9;&#x751F;&#x4EA7;&#x51FA;&#x6765;&#x3002;</strong></p>
<p><img src="images/web1-2.jpg" alt=""></p>
<!-- ![](images/web2.jpg) -->
<ul>
<li><strong>Web 3.0&#x65F6;&#x4EE3;&#x2014;&#x2014;&#x2014;&#x2014;&#x56DE;&#x5F52;&#x521D;&#x8877;&#xFF0C;&#x4EE5;&#x4EBA;&#x4E3A;&#x672C;</strong></li>
</ul>
<p>&#x5728; 3.0 &#x9636;&#x6BB5;&#xFF0C;&#x4E00;&#x62E8;&#x65B0;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x5192;&#x9669;&#x5BB6;&#x68A6;&#x60F3;&#x6210;&#x4E3A;&#x65F6;&#x4EE3;&#x7684;&#x7EE7;&#x4EFB;&#x8005;&#x3002;&#x4ED6;&#x4EEC;&#x8BBE;&#x60F3;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x5C06;&#x56DE;&#x5F52;&#x81F3; Web 1.0 &#x7684;&#x613F;&#x666F;&#xFF1A;&#x66F4;&#x300C;&#x4EBA;&#x6027;&#x5316;&#x300D;&#xFF0C;&#x4E5F;&#x66F4;&#x9690;&#x79C1;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x6743;&#x529B;&#x548C;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x5728;&#x5DE8;&#x5927;&#x7684;&#x516C;&#x53F8;&#x5E9E;&#x7136;&#x5927;&#x7269;&#x624B;&#x4E2D;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x5DE8;&#x517D;&#x5F80;&#x5F80;&#x88AB;&#x89C6;&#x4F5C;&#x4F60;&#x7684;&#x9690;&#x79C1;&#x5408;&#x6CD5;&#x6240;&#x6709;&#x8005;&#x3002;</p>
<p>&#x66F4;&#x516C;&#x5E73;&#x3001;&#x900F;&#x660E;&#x7684;&#x7F51;&#x7EDC;&#x613F;&#x666F;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230; 2006 &#x5E74;&#x5DE6;&#x53F3;&#xFF0C;&#x4F46;&#x5728;&#x90A3;&#x65F6;&#xFF0C;&#x5DE5;&#x5177;&#x548C;&#x6280;&#x672F;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x613F;&#x666F;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x8BDE;&#x751F;&#x4EE5;&#x6765;&#xFF0C;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x8D26;&#x672C;&#x3001;&#x533A;&#x5757;&#x94FE;&#x5E26;&#x6765;&#x4E86;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x6570;&#x5B57;&#x5B58;&#x50A8;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x4E2A;&#x8BBE;&#x60F3;&#x63D0;&#x5021;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x800C;&#x533A;&#x5757;&#x94FE;&#x662F;&#x5B9E;&#x73B0;&#x7684;&#x65B0;&#x5174;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x3002;&#x4ECE;&#x6B64;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x4F3C;&#x4E4E;&#x53EF;&#x4EE5;&#x771F;&#x6B63;&#x53BB;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x4EE5;&#x4EBA;&#x4E3A;&#x672C;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x5F62;&#x6001;&#x3002;</p>
<p><strong>Web 3.0 &#x65F6;&#x4EE3;&#xFF0C;&#x5546;&#x573A;&#x66F4;&#x52A0;&#x667A;&#x80FD;&#x5316;&#x4EBA;&#x6027;&#x5316;&#xFF0C;&#x4F60;&#x60F3;&#x53BB;&#x5546;&#x573A;&#x5403;&#x996D;&#xFF0C;&#x5546;&#x573A;&#x4F1A;&#x5206;&#x6790;&#x4F60;&#x7684;&#x53E3;&#x5473;&#x3001;&#x996E;&#x98DF;&#x4E60;&#x60EF;&#x3001;&#x5065;&#x5EB7;&#x72B6;&#x51B5;&#x7B49;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x6700;&#x9002;&#x5408;&#x7684;&#x4E00;&#x5BB6;&#x9910;&#x5385;&#xFF0C;&#x800C;&#x4E14;&#x7ED9;&#x4F60;&#x63A8;&#x8350;&#x9910;&#x5385;&#x6700;&#x9002;&#x5408;&#x4F60;&#x7684;&#x83DC;&#x54C1;&#x3002;</strong></p>
<p><img src="images/web3.png" alt=""></p>
<h3 id="23-&#x6211;&#x8981;&#x5230;&#x54EA;&#x91CC;&#x53BB;&#xFF1F;">2.3 &#x6211;&#x8981;&#x5230;&#x54EA;&#x91CC;&#x53BB;&#xFF1F;</h3>
<p>&#x968F;&#x7740; Web 3.0 &#x5F00;&#x59CB;&#x884C;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x65B0;&#x7684;&#x5E73;&#x53F0;&#x5C06;&#x51FA;&#x73B0;&#xFF0C;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x5784;&#x65AD;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5BFC;&#x81F4;&#x4E0D;&#x516C;&#x5E73;&#x7684;&#x7ADE;&#x4E89;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6CA1;&#x6709;&#x8C01;&#x4F1A;&#x88AB;&#x5F7B;&#x5E95;&#x629B;&#x5F03;&#xFF0C;&#x6B63;&#x5982; Web 2.0 &#x4E0D;&#x4F1A;&#x6D88;&#x5931;&#xFF0C;&#x4ECD;&#x7136;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x67D0;&#x4E9B;&#x5730;&#x65B9;&#x5403;&#x7070;&#x7684; Web 1.0 &#x4E00;&#x6837;&#xFF0C;&#x8FC1;&#x79FB;&#x5230; Web 3.0 &#x4E0E;&#x73B0;&#x6709;&#x7684;&#x5728;&#x7EBF;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#x96C6;&#x6210;&#xFF0C;&#x4ECD;&#x9700;&#x8981;&#x4E0D;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<blockquote>
<p><strong>Web 3.0 &#x672A;&#x6765;&#x5DF2;&#x6765;&#x3002;&#x5217;&#x8F66;&#x5DF2;&#x7ECF;&#x542F;&#x52A8;&#xFF0C;&#x4E14;&#x4E0D;&#x4F1A;&#x6389;&#x5934;&#x3002;</strong></p>
</blockquote>
<h2 id="3-&#x63A8;&#x8350;&#x7F51;&#x7AD9;">3. &#x63A8;&#x8350;&#x7F51;&#x7AD9;</h2>
<ul>
<li><strong><a href="http://www.w3school.com.cn/" target="_blank">w3school &#x5728;&#x7EBF;&#x6559;&#x7A0B;</a></strong></li>
</ul>
<p>&#x5185;&#x5BB9;&#x4E0D;&#x5168;&#xFF0C;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x8FC7;&#x65F6;</p>
<p><code>www.w3school.com.cn</code> </p>
<ul>
<li><strong><a href="http://www.runoob.com/" target="_blank">&#x83DC;&#x9E1F;&#x6559;&#x7A0B;</a></strong></li>
</ul>
<p>&#x9002;&#x5408;&#x65B0;&#x624B;&#x5165;&#x95E8;&#x5B66;&#x4E60;&#x548C;&#x53C2;&#x8003;</p>
<p><code>www.runoob.com</code> </p>
<ul>
<li><strong><a href="http://devdocs.io/" target="_blank">DevDocs API Documentation</a></strong></li>
</ul>
<p>&#x624B;&#x518C;&#x6DB5;&#x76D6;&#x5168;&#x9762;&#xFF0C;&#x5185;&#x5BB9;&#x5B9E;&#x65F6;&#x66F4;&#x65B0;</p>
<p><code>devdocs.io</code> </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: 第一章 前端开发">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../node1/" class="navigation navigation-next " aria-label="Next page: 第一节 HTML基础课程">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"章前序 前端简介","level":"1.2.1","depth":2,"next":{"title":"第一节 HTML基础课程","level":"1.2.2","depth":2,"path":"chapter1/node1/README.md","ref":"chapter1/node1/README.md","articles":[]},"previous":{"title":"第一章 前端开发","level":"1.2","depth":1,"path":"chapter1/README.md","ref":"chapter1/README.md","articles":[{"title":"章前序 前端简介","level":"1.2.1","depth":2,"path":"chapter1/node0/README.md","ref":"chapter1/node0/README.md","articles":[]},{"title":"第一节 HTML基础课程","level":"1.2.2","depth":2,"path":"chapter1/node1/README.md","ref":"chapter1/node1/README.md","articles":[]},{"title":"第二节 CSS基础课程","level":"1.2.3","depth":2,"path":"chapter1/node2/README.md","ref":"chapter1/node2/README.md","articles":[]},{"title":"第三节 JavaScript入门与实战","level":"1.2.4","depth":2,"path":"chapter1/node3/README.md","ref":"chapter1/node3/README.md","articles":[]},{"title":"第四节 JavaScript高级实战","level":"1.2.5","depth":2,"path":"chapter1/node4/README.md","ref":"chapter1/node4/README.md","articles":[]},{"title":"第五节 jQuery入门与实战","level":"1.2.6","depth":2,"path":"chapter1/node5/README.md","ref":"chapter1/node5/README.md","articles":[]},{"title":"第六节 常用库和前端框架","level":"1.2.7","depth":2,"path":"chapter1/node6/README.md","ref":"chapter1/node6/README.md","articles":[]},{"title":"第七节 HTML5新功能和高级机制","level":"1.2.8","depth":2,"path":"chapter1/node7/README.md","ref":"chapter1/node7/README.md","articles":[]},{"title":"第八节 CSS3新特性详解","level":"1.2.9","depth":2,"path":"chapter1/node8/README.md","ref":"chapter1/node8/README.md","articles":[]},{"title":"第九节 实战案例","level":"1.2.10","depth":2,"path":"chapter1/node9/README.md","ref":"chapter1/node9/README.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","ebook":"styles/ebook.css","pdf":"styles/pdf.css","mobi":"styles/mobi.css","epub":"styles/epub.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh-hans","gitbook":"*"},"file":{"path":"chapter1/node0/README.md","mtime":"2018-07-02T15:52:49.306Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-07-27T02:11:06.977Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

